let size = prompt("Введіть ваш розмір верхнього одягу:") || alert ("Розмір невведено");
if (size >= 40 && size < 42) {
    alert ("Цей розмір відповідає американському розміру S");
}
if (size >= 42 && size < 46) {
    alert ("Цей розмір відповідає американському розміру M");
}
if (size >= 46 && size < 50) {
    alert ("Цей розмір відповідає американському розміру L");
}
if (size >= 50 && size < 54) {
    alert ("Цей розмір відповідає американському розміру XL");
}
if (size == 54) {
    alert ("Цей розмір відповідає американському розміру XXL");
}
if (size > 54) {
    alert ("Вибачте, даний розмір непредставлено у нас в магазині");
}